/******************************************************************************

                CS5532应用相关实现
//主要实现与SW-24的应用程序接口
******************************************************************************/

#ifndef __CCS5532_APP_H
#define __CCS5532_APP_H

/******************************************************************************
                             相关配置
******************************************************************************/

#define CS5532APP_TIMER_COUNT		100 //数据转换期间定义等待定时周期

/******************************************************************************
                             相关结构
******************************************************************************/
#include"CS553xDev.h"    //Spi设备定义


enum _CS5532App_State{//状态机
  eCS5532App_State_Idie		=0,   //空闲
  eCS5532App_State_Wait		=1,   //等待数据过程中
  eCS5532App_State_Done		=2   //转换完成
};


struct _CS5532App{
  struct _CS553xDev CS5532Dev;  //实例化一个芯片
  unsigned char DataBuf[16];     //缓冲区定义
  enum _CS5532App_State eState; //状态机
  unsigned char Timer;         //定时器
};

extern struct _CS5532App CS5532App;  //直接实例化

/******************************************************************************
                             相关函数
******************************************************************************/

//-------------------------------初始化函数-------------------------------
void CS5532App_Init (void);

//-------------------------------芯片初始化函数-----------------------------
//返回值定义为: 0xff:芯片复位错误,其它:通讯期间故障发生次数
unsigned char CS5532App_CS5532Init(void);

//-----------------------------任务函数-----------------------------
//放入一个CS5532读写周期及一个单次AD转换周期能够处理完成的系统进程中
void CS5532App_Task(void);

//-----------------------------CS553xDevMISO引脚中断函数实现-------------------------
void CS553xDev_Int(void);

/******************************************************************************
                             相关回调函数
******************************************************************************/

//------------------CS5532App采集完数据回调函数---------------------
void CS5532App_cbFinal(unsigned long AD);




#endif  //#define __CCS5532_APP_H

