/**********************************************************************************************

                              Int0引脚处理模块
此模块独立于应用
**********************************************************************************************/

#ifndef  __INT0_H
#define  __INT0_H

/********************************************************************************************
                                  相关配置
********************************************************************************************/


//开发环境配置:
//#include <avr/IO.h>  //AVRGCC环境时
#include <ioavr.h>//IAR环境时
/********************************************************************************************
                                  相关函数
********************************************************************************************/


//---------------------------------初始化函数-------------------------------------
//形参为默认触发模式,具体值见Int0_CfgMode定义
void Int0_Init(unsigned char IntMode);

//-------------------------------配置触发模式函数----------------------------------
//形参为触发模式对应于ISC11 ISC10,即:
#define INT0_MODE_LOW      0            //低电平触发
#define INT0_MODE_CHANGE  (1 << ISC00)   //上任意的逻辑电平变化都将引发中断
#define INT0_MODE_RISE    (1 << ISC01)   //下降沿产生异步中断请求
#define INT0_MODE_FAIL    ((1 << ISC00)|(1 << ISC01))   //的上升沿产生异步中断请求
//void Int0_CfgMode(unsigned char IntMode);
#define Int0_CfgMode(IntMode) \
  do{MCUCR &= ~((1 << ISC10)|(1 << ISC11)); MCUCR |= IntMode;}while(0)

//---------------------------------中断允许函数-------------------------------------
//即开始执行中断
//void Int0_En(void);
#define Int0_En() \
  do{GICR |= (1 << INT0);}while(0)

//---------------------------------中断禁止函数-------------------------------------
//即停止执行中断
//void Int0_Dis(void);
#define Int0_Dis() \
  do{GICR &= ~(1 << INT0);}while(0)

/**************************************************************************
                           回调函数
***************************************************************************/
//-------------------------INT0 IO初始化函数------------------------------
//void Int0_cbIoInit(void);
//直接宏定义为输入上拉模式
#define Int0_cbIoInit() do{DDRD &= ~0x04; PORTD |= 0x04;}while(0)

//-------------------------中断内回调函数------------------------------
//中断发生时中断函数内将会调用此函数
//void Int0_cbTask(void);
//直接实现:
#include "CS5532App.h"
#define Int0_cbTask() do{CS553xDev_Int();}while(0)


#endif

